export const solution_201910 = {

    init () {
		
		console.log("==================== start 2019-09 =============================");

		this.task = Object.keys(solution_201909).filter(item => item !== 'init');
		
        this.task.forEach(item => console.log(this[item]()));
    },
    "2019-10-31" () {

        // 2019-09-31：sku算法———多维属性状态判断
		// 难度 ★★★☆
        // 算法简化：假设只有3种状态：1、颜色：红蓝灰。2、尺码、大中小。型号、ABC。
        // 此时库存只有以下数据源：
		// [
		// 	{ "颜色": "红", "尺码": "大", "型号": "A", "skuId": "3158054" },
		// 	{ "颜色": "白", "尺码": "中", "型号": "B", "skuId": "3133859" },
		// 	{ "颜色": "蓝", "尺码": "小", "型号": "C", "skuId": "3516833" }
		// ]
		// 数据源不可选时将选项按钮置灰并禁用点击，请写出该SKU算法。
    }
}


